#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/imagebuilder/imagebuilder-deployment/runs/run-MJL2Ky72qZio2TWT

Waiting for the plan to start...

Terraform v0.13.5
Configuring remote state backend...
Initializing Terraform configuration...
Refreshing Terraform state in-memory prior to plan...
The refreshed state will be used to calculate this plan, but will not be
persisted to local or remote state storage.

data.template_file.worker_user_data: Refreshing state... [id=c6c2cc78eb9c4f026324c659f366f7412e0c00adc58266553d8a47ad2362166c]
data.aws_iam_policy_document.spotfleet_iam_spot_policy: Refreshing state...
data.aws_iam_policy_document.vmimport_trust: Refreshing state... [id=4085548158]
aws_iam_role_policy_attachment.spot_request_policy: Refreshing state... [id=SpotFleetTaggingRoleForImageBuilder-20201116204034260500000001]
data.aws_iam_policy_document.vmimport_ec2: Refreshing state... [id=315687832]
aws_iam_user.imagebuilder_stage: Refreshing state... [id=imagebuilder-stage]
data.aws_iam_policy_document.spotfleet_iam_role_policy: Refreshing state...
aws_s3_bucket.imagebuilder_stage: Refreshing state... [id=imagebuilder-service-stage]
data.aws_iam_policy_document.vmimport_s3: Refreshing state... [id=1089363423]
data.aws_vpc.internal_vpc: Refreshing state... [id=vpc-06d6127910664367d]
data.aws_vpc.external_vpc: Refreshing state... [id=vpc-78468405]
aws_iam_user.imagebuilder_prod: Refreshing state... [id=imagebuilder-prod]
data.aws_availability_zones.available: Refreshing state... [id=us-east-1]
data.aws_iam_policy_document.imagebuilder_prod: Refreshing state... [id=2377160203]
data.aws_caller_identity.current: Refreshing state... [id=933752197999]
aws_s3_bucket.imagebuilder_prod: Refreshing state... [id=imagebuilder-service-prod]
data.aws_iam_policy_document.imagebuilder_stage: Refreshing state... [id=1407615633]
data.aws_ami.rhel8_x86: Refreshing state... [id=ami-0c82f7789103a1e20]
aws_iam_policy.vmimport_ec2: Refreshing state... [id=arn:aws:iam::933752197999:policy/vmimport_ec2]
aws_iam_role.spot_fleet_tagging_role: Refreshing state... [id=SpotFleetTaggingRoleForImageBuilder]
aws_iam_role.vmimport: Refreshing state... [id=vmimport]
aws_iam_policy.vmimport_s3: Refreshing state... [id=arn:aws:iam::933752197999:policy/vmimport_s3]
aws_iam_policy.imagebuilder_prod_workers_s3: Refreshing state... [id=arn:aws:iam::933752197999:policy/imagebuilder-prod-workers-s3]
aws_iam_policy.imagebuilder_stage_workers_s3: Refreshing state... [id=arn:aws:iam::933752197999:policy/imagebuilder-stage-workers-s3]
aws_iam_user_policy_attachment.imagebuilder_prod_vmimport: Refreshing state... [id=imagebuilder-prod-20201116162803345100000002]
aws_iam_user_policy_attachment.imagebuilder_stage_vmimport: Refreshing state... [id=imagebuilder-stage-20201116162803358800000003]
aws_iam_role_policy_attachment.vmimport_ec2: Refreshing state... [id=vmimport-20201116162803367200000004]
aws_iam_role_policy_attachment.vmimport_s3: Refreshing state... [id=vmimport-20201116162803320500000001]
aws_iam_user_policy_attachment.imagebuilder_prod_s3: Refreshing state... [id=imagebuilder-prod-20201113204258223300000001]
aws_iam_user_policy_attachment.imagebuilder_stage_s3: Refreshing state... [id=imagebuilder-stage-20201113204258227600000002]
data.aws_subnet_ids.internal_subnets: Refreshing state... [id=vpc-06d6127910664367d]
aws_vpc_endpoint.internal_vpc_s3: Refreshing state... [id=vpce-0875d858ff2d5a00c]
aws_security_group.allow_ssh: Refreshing state... [id=sg-04c3b57abc095a9ab]
aws_security_group.allow_icmp: Refreshing state... [id=sg-01794fd088245ef29]
aws_launch_template.worker_x86: Refreshing state... [id=lt-0cbb229d67d85ee00]
data.aws_subnet_ids.external_subnets: Refreshing state... [id=vpc-78468405]
aws_spot_fleet_request.imagebuilder_worker_x86: Refreshing state... [id=sfr-f1a8c8ce-7721-4591-806f-62afbf5005b3]

------------------------------------------------------------------------

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # aws_iam_policy.spotfleet_iam_spot_policy will be created
  + resource "aws_iam_policy" "spotfleet_iam_spot_policy" {
      + arn    = (known after apply)
      + id     = (known after apply)
      + name   = "vmimport_s3"
      + path   = "/"
      + policy = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "ec2:RunInstances",
                          + "ec2:RequestSpotInstances",
                          + "ec2:DescribeSubnets",
                          + "ec2:DescribeInstanceStatus",
                          + "ec2:DescribeImages",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = "1"
                    },
                  + {
                      + Action    = "iam:PassRole"
                      + Condition = {
                          + StringEquals = {
                              + iam:PassedToService = [
                                  + "ec2.amazonaws.com.cn",
                                  + "ec2.amazonaws.com",
                                ]
                            }
                        }
                      + Effect    = "Allow"
                      + Resource  = "*"
                      + Sid       = "2"
                    },
                  + {
                      + Action   = "ec2:CreateTags"
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:ec2:*:*:volume/*",
                          + "arn:aws:ec2:*:*:spot-instances-request/*",
                          + "arn:aws:ec2:*:*:spot-fleet-request/*",
                          + "arn:aws:ec2:*:*:instance/*",
                        ]
                      + Sid      = "3"
                    },
                  + {
                      + Action    = "ec2:TerminateInstances"
                      + Condition = {
                          + StringLike = {
                              + ec2:ResourceTag/aws:ec2spot:fleet-request-id = "*"
                            }
                        }
                      + Effect    = "Allow"
                      + Resource  = "*"
                      + Sid       = "4"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
    }

  # aws_iam_role_policy_attachment.spot_request_policy will be destroyed
  - resource "aws_iam_role_policy_attachment" "spot_request_policy" {
      - id         = "SpotFleetTaggingRoleForImageBuilder-20201116204034260500000001" -> null
      - policy_arn = "arn:aws:iam::aws:policy/service-role/AmazonEC2SpotFleetTaggingRole" -> null
      - role       = "SpotFleetTaggingRoleForImageBuilder" -> null
    }

  # aws_iam_role_policy_attachment.spotfleet_iam_role_policy will be created
  + resource "aws_iam_role_policy_attachment" "spotfleet_iam_role_policy" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AmazonEC2SpotFleetTaggingRole"
      + role       = "SpotFleetTaggingRoleForImageBuilder"
    }

  # aws_iam_role_policy_attachment.spotfleet_iam_spot_policy will be created
  + resource "aws_iam_role_policy_attachment" "spotfleet_iam_spot_policy" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "SpotFleetTaggingRoleForImageBuilder"
    }

Plan: 3 to add, 0 to change, 1 to destroy.
```

</details>

*Pusher: @major, Action: `pull_request`*